tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"
tap "github/gh"
tap "hashicorp/tap"
tap "borkdude/brew"

brew "mas"
brew "gcc"
brew "git"
brew "go"
brew "httpie"
brew "vault"
brew "starship"
brew "gh"
brew "stow"
brew "gnu-sed"
brew "gopls"
brew "helm"
brew "htop"
brew "jenv"
brew "kcat"
brew "magic-wormhole"
brew "maven"
brew "n"
brew "plantuml"
brew "protobuf"
brew "podman"
brew "ranger"
brew "shellcheck"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tokei"
brew "tree"
brew "yamllint"
brew "poetry"
brew "make"
brew "kubernetes-cli"
brew "jq"
brew "jenv"
brew "grpcurl"
brew "golangci-lint"
brew "curl"
brew "hashicorp/tap/terraform-ls"
brew "youtube-dl"
brew "ripgrep"
brew "libgccjit"
brew "emacs-plus@29", args: ["with-xwidgets", "with-native-comp", "with-imagemagick", "with-ctags", "with-mailutils"]
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "autojump"
brew "docker-compose"
brew "readline"
brew "librdkafka"
brew "openssl"
brew "pkg-con***REMOVED***g"
brew "redis"
brew "fzf"
brew "nnn"
brew "borkdude/brew/babashka"
brew "openjdk"
brew "nvm"
brew "libusb"
brew "neovim"

cask "stats"
cask "sublime-text"
cask "visual-studio-code"
cask "google-drive"
cask "rectangle"
cask "font-jetbrains-mono"
cask "kubecontext"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "lastpass"
cask "jetbrains-toolbox"
cask "mpv"
cask "fork"
cask "docker"
cask "google-cloud-sdk"
cask "iterm2"
cask "maccy"
# brew "emacs-mac", args: ["with-native-comp", "with-imagemagick", "with-ctags", "HEAD"]

mas "Bitwarden", id: 1352778147
mas "AdGuard for Safari", id: 1440147259
mas "Vimari", id: 1480933944
mas "Amphetamine", id: 937984704
mas "Infuse 7", id: 1136220934
mas "PiPi***REMOVED***er", id: 1160374471
mas "Xcode", id: 497799835
